app/views/categories/_events.html.erb

  <p class="is-size-4 has-text-weight-bold">Upcoming Events </p>
  <%= show_events(Category.find(3)) %>
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]