app/views/layouts/application.html.erb

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
          <span>
            <%= link_to 'DOTA 2', category_path(Category.find(5)), class: 'button is-navbar pr-3 is-size-09' %>

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
          <span>
            <%= link_to 'CS:GO', category_path(Category.find(8)), class: 'button is-navbar pr-3 is-size-09' %>

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
          <span>
            <%= link_to 'VALORANT', category_path(Category.find(6)), class: 'button is-navbar pr-3 is-size-09' %>

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
          <span>
            <%= link_to 'LOL', category_path(Category.find(7)), class: 'button is-navbar pr-3 is-size-09' %>

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
            <div id="myDropdown" class="dropdown-content">
              <%= link_to 'News', category_path(Category.find(1)), class: 'is-size-09 has-text-semibold' %>
              <%= link_to 'Patch Notes', category_path(Category.find(3)), class: 'is-size-09 has-text-semibold' %>
              <%= link_to 'Releases', category_path(Category.find(4)), class: 'is-size-09 has-text-semibold' %>